snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	//Валетов + 28,01,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8673 Перенес запрет на форму списка 
	//Отказ = Истина;  
	//Сообщить("Открытие данной формы запрещено");  
	//Валетов -
	
	МаркировкаС.УстановитьОтборДинСписка(СтатусыКМ_ЧЗ, 		Новый Структура("ШтрихКодУпаковки", Объект.Ссылка));
	МаркировкаС.УстановитьОтборДинСписка(СтатусыКМ_Факт, 	Новый Структура("ШтрихКодУпаковки", Объект.Ссылка));	
	
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(Короба, "ШтрихКодУпаковки", Объект.Ссылка, Истина);
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(Наборы, "ШтрихКодУпаковки", Объект.Ссылка, Истина);
	
	Если Объект.ТипКода = Перечисления.ТипыКодовМаркировки.АТК Тогда
			
		МаркировкаКС.УстановитьПараметрДинамическогоСписка(СоставАТК, "КодАТК", Объект.Наименование, Истина);	
		
		Элементы.сКодыАТК.Видимость = Истина;
		
	ИначеЕсли Объект.ТипКода = Перечисления.ТипыКодовМаркировки.ЛогистическаяУпаковка Тогда
		
		Элементы.сВложенныеШтрихкоды.Видимость = Истина;	
		
	ИначеЕсли Объект.ТипКода = Перечисления.ТипыКодовМаркировки.Набор Тогда
		
		Элементы.сВложенныеШтрихкоды.Видимость = Истина;	
		
	ИначеЕсли Объект.ТипКода = Перечисления.ТипыКодовМаркировки.Товар Тогда
		
		Элементы.сКороба.Видимость = Истина;
	
	КонецЕсли;
	
КонецПроцедуры
